In [24]:
import os
import pandas as pd
from pandas import DataFrame as df
from sqlalchemy import create_engine, MetaData, Table, select, insert
from sqlalchemy.pool import NullPool


ora_id = os.environ['ORACLE_ID']
ora_pw = os.environ['ORACLE_PW']
ora_ip = os.environ['ORACLE_IP']
ora_port = os.environ['ORACLE_PORT']
ora_sid = os.environ['ORACLE_SID']

# sqlalchemy_addr Database Urls 예시
# engine = create_engine('oracle://scott:tiger@127.0.0.1:1521/sidname')
# engine = create_engine('oracle+cx_oracle://scott:tiger@tnsname')
sqlalchemy_addr = 'oracle://' + ora_id+':' + ora_pw + '@' + ora_ip + ':' + ora_port + '/' + ora_sid
engine = create_engine(sqlalchemy_addr, echo=False, poolclass=NullPool)

In [25]:
meta = MetaData()

conn = engine.raw_connection()
cur_sel = conn.cursor()
cur_ins = conn.cursor()
cur_del = conn.cursor()

In [26]:



jobs = Table('JOBS', meta, schema='HR', autoload=True, autoload_with=engine)
jobs2 = Table('JOBS2', meta, schema='HR', autoload=True, autoload_with=engine)

jobs_select = str(jobs.select())
print(jobs_select)

jobs2_select = str(jobs2.select())
print(jobs2_select)

jobs2_insert = str(jobs2.insert())
print(jobs2_insert)

jobs2_delete = str(jobs2.delete())
print(jobs2_delete)

SELECT "HR"."JOBS".job_id, "HR"."JOBS".job_title, "HR"."JOBS".min_salary, "HR"."JOBS".max_salary
FROM "HR"."JOBS"
SELECT "HR"."JOBS2".job_id, "HR"."JOBS2".job_title, "HR"."JOBS2".min_salary, "HR"."JOBS2".max_salary
FROM "HR"."JOBS2"
INSERT INTO "HR"."JOBS2" (job_id, job_title, min_salary, max_salary) VALUES (:job_id, :job_title, :min_salary, :max_salary)
DELETE FROM "HR"."JOBS2"

In [27]:
cur_sel.arraysize = 5

# 커서에 sql 셋팅
cur_sel.execute(jobs_select)

# fetchsize 만큼 리스트 형태로 리턴 (정확히는 리스트안에 튜플들이 담겨있음.)
rows = cur_sel.fetchmany()
# rows = cur_sel.fetchmany(numRows=1)

# 더이상 결과가 없으면 빈리스트로 리턴.
while len(rows) != 0 :
    
    print(rows)
    
    # 여러 결과를 한번에 insert 처리.
    cur_ins.executemany(jobs2_insert, rows)

    conn.commit()
    
    rows = cur_sel.fetchmany()

[('AD_PRES', 'President', 20080, 40000), ('AD_VP', 'Administration Vice President', 15000, 30000), ('AD_ASST', 'Administration Assistant', 3000, 6000), ('FI_MGR', 'Finance Manager', 8200, 16000), ('FI_ACCOUNT', 'Accountant', 4200, 9000)]
[('AC_MGR', 'Accounting Manager', 8200, 16000), ('AC_ACCOUNT', 'Public Accountant', 4200, 9000), ('SA_MAN', 'Sales Manager', 10000, 20080), ('SA_REP', 'Sales Representative', 6000, 12008), ('PU_MAN', 'Purchasing Manager', 8000, 15000)]
[('PU_CLERK', 'Purchasing Clerk', 2500, 5500), ('ST_MAN', 'Stock Manager', 5500, 8500), ('ST_CLERK', 'Stock Clerk', 2008, 5000), ('SH_CLERK', 'Shipping Clerk', 2500, 5500), ('IT_PROG', 'Programmer', 4000, 10000)]
[('MK_MAN', 'Marketing Manager', 9000, 15000), ('MK_REP', 'Marketing Representative', 4000, 9000), ('HR_REP', 'Human Resources Representative', 4000, 9000), ('PR_REP', 'Public Relations Representative', 4500, 10500)]

In [28]:

df = pd.read_sql(jobs_select, conn)
df

        JOB_ID                        JOB_TITLE  MIN_SALARY  MAX_SALARY
0      AD_PRES                        President       20080       40000
1        AD_VP    Administration Vice President       15000       30000
2      AD_ASST         Administration Assistant        3000        6000
3       FI_MGR                  Finance Manager        8200       16000
4   FI_ACCOUNT                       Accountant        4200        9000
5       AC_MGR               Accounting Manager        8200       16000
6   AC_ACCOUNT                Public Accountant        4200        9000
7       SA_MAN                    Sales Manager       10000       20080
8       SA_REP             Sales Representative        6000       12008
9       PU_MAN               Purchasing Manager        8000       15000
10    PU_CLERK                 Purchasing Clerk        2500        5500
11      ST_MAN                    Stock Manager        5500        8500
12    ST_CLERK                      Stock Clerk        2008        5000
13    SH_CLERK                   Shipping Clerk        2500        5500
14     IT_PROG                       Programmer        4000       10000
15      MK_MAN                Marketing Manager        9000       15000
16      MK_REP         Marketing Representative        4000        9000
17      HR_REP   Human Resources Representative        4000        9000
18      PR_REP  Public Relations Representative        4500       10500

In [29]:

df = pd.read_sql(jobs_select, conn)
df

        JOB_ID                        JOB_TITLE  MIN_SALARY  MAX_SALARY
0      AD_PRES                        President       20080       40000
1        AD_VP    Administration Vice President       15000       30000
2      AD_ASST         Administration Assistant        3000        6000
3       FI_MGR                  Finance Manager        8200       16000
4   FI_ACCOUNT                       Accountant        4200        9000
5       AC_MGR               Accounting Manager        8200       16000
6   AC_ACCOUNT                Public Accountant        4200        9000
7       SA_MAN                    Sales Manager       10000       20080
8       SA_REP             Sales Representative        6000       12008
9       PU_MAN               Purchasing Manager        8000       15000
10    PU_CLERK                 Purchasing Clerk        2500        5500
11      ST_MAN                    Stock Manager        5500        8500
12    ST_CLERK                      Stock Clerk        2008        5000
13    SH_CLERK                   Shipping Clerk        2500        5500
14     IT_PROG                       Programmer        4000       10000
15      MK_MAN                Marketing Manager        9000       15000
16      MK_REP         Marketing Representative        4000        9000
17      HR_REP   Human Resources Representative        4000        9000
18      PR_REP  Public Relations Representative        4500       10500

In [30]:
sql = 'SELECT * FROM HR.JOBS2 '

df = pd.read_sql(sql, conn)
df

        JOB_ID                        JOB_TITLE  MIN_SALARY  MAX_SALARY
0     PU_CLERK                 Purchasing Clerk        2500        5500
1       ST_MAN                    Stock Manager        5500        8500
2     ST_CLERK                      Stock Clerk        2008        5000
3     SH_CLERK                   Shipping Clerk        2500        5500
4      IT_PROG                       Programmer        4000       10000
5       MK_MAN                Marketing Manager        9000       15000
6       MK_REP         Marketing Representative        4000        9000
7       HR_REP   Human Resources Representative        4000        9000
8       PR_REP  Public Relations Representative        4500       10500
9      AD_PRES                        President       20080       40000
10       AD_VP    Administration Vice President       15000       30000
11     AD_ASST         Administration Assistant        3000        6000
12      FI_MGR                  Finance Manager        8200       16000
13  FI_ACCOUNT                       Accountant        4200        9000
14      AC_MGR               Accounting Manager        8200       16000
15  AC_ACCOUNT                Public Accountant        4200        9000
16      SA_MAN                    Sales Manager       10000       20080
17      SA_REP             Sales Representative        6000       12008
18      PU_MAN               Purchasing Manager        8000       15000

In [31]:

sql = 'SELECT * FROM HR.JOBS '

cur_sel.arraysize = 3

# 커서에 sql 셋팅
cur_sel.execute(sql)

# fetchsize 만큼 리스트 형태로 리턴 (정확히는 리스트안에 튜플들이 담겨있음.)
row = cur_sel.fetchone()

while row is not None :
    print(row)
    # print(row[1])
    row = cur_sel.fetchone()

('AD_PRES', 'President', 20080, 40000)
('AD_VP', 'Administration Vice President', 15000, 30000)
('AD_ASST', 'Administration Assistant', 3000, 6000)
('FI_MGR', 'Finance Manager', 8200, 16000)
('FI_ACCOUNT', 'Accountant', 4200, 9000)
('AC_MGR', 'Accounting Manager', 8200, 16000)
('AC_ACCOUNT', 'Public Accountant', 4200, 9000)
('SA_MAN', 'Sales Manager', 10000, 20080)
('SA_REP', 'Sales Representative', 6000, 12008)
('PU_MAN', 'Purchasing Manager', 8000, 15000)
('PU_CLERK', 'Purchasing Clerk', 2500, 5500)
('ST_MAN', 'Stock Manager', 5500, 8500)
('ST_CLERK', 'Stock Clerk', 2008, 5000)
('SH_CLERK', 'Shipping Clerk', 2500, 5500)
('IT_PROG', 'Programmer', 4000, 10000)
('MK_MAN', 'Marketing Manager', 9000, 15000)
('MK_REP', 'Marketing Representative', 4000, 9000)
('HR_REP', 'Human Resources Representative', 4000, 9000)
('PR_REP', 'Public Relations Representative', 4500, 10500)

In [32]:

# delete
cur_del.execute(jobs2_delete)
conn.commit()

In [33]:
cur_sel.close()
cur_ins.close()
cur_del.close()

conn.close()

In [34]:
engine.dispose()